УТ_11_4.Umico/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="71ba13b0-5734-4f37-bfc0-33a791b4e7e2">
  <name>СтатусыЧековККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b8d448b2-f4c4-4fef-bd83-69bf834a37d5">
    <name>ТоварЗарезервирован</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8c29b28c-3389-4788-aa0d-03fdff0dcec4">
    <name>Пробит</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="238e807a-b6d8-401c-b115-0e10b84a16c1">
    <name>Отложен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_11_4.Umico/src/Documents/ЧекККМВозврат/ЧекККМВозврат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="19c63914-92ce-4573-9a35-c1ea61e7a23d">
  <name>ЧекККМВозврат</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="11462406-65c5-4b89-a31f-928ff51b2b54">
    <name>ЧекККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.ЧекККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>UMC_НомерКартыUmico</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UMC_ОплаченноБалламиUmico</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="dc576429-9659-4271-8f29-a30c718d3b33">
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="882e156f-fb1a-4dc4-9d8a-388e8f95f606">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="b57e72ea-4f76-49bb-b2c7-3f553879edf9">
    <name>КассоваяСмена</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="187168a5-e731-4f9c-93a1-dd5f5e17fde2">
    <name>Кассир</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="b3286257-e9bb-4f93-90a8-21c0293cdc0a">
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="66818612-777d-457c-b18a-67c332762e56">
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="a8c72a24-a385-45d4-9b74-f0036e4d090c">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.СтатусыЧековККМ</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="f151b0c4-5b99-473a-bbcc-23ab8ce8e168">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="d44d98e3-37ca-40df-8743-d72b1a10ec8b">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="5d77c6ab-789c-44c3-9350-59d8b8a6b416">
    <name>КартаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.КартыЛояльности</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="5d4f5d05-9b50-4cd5-9dd8-bda1e1982dfa">
    <name>СуммаБонусныхБалловКВозврату</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="c8ac9972-046a-4f8c-8d09-197179d41106">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="f94b0d48-4bd4-4f12-90ae-dde9ee68ae74">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="e1b9633d-4d9f-451b-acee-56fc670affb3">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="7fcf83b9-397f-4e74-9332-c4f28a1c93aa">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="b86d15a2-a07b-4e36-887b-9e1df1f11ff6">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="cecdc85d-e5ea-4ec7-891a-7129fd0b769f">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="5c19cff2-8ca9-490b-98d9-dfc7da90dad5">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="cbaa2c69-bfcd-4f65-99da-6430a7f7e300">
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="bd9dc0b3-f984-4dcd-aae6-d33da978dc79">
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="61f9fc6c-e97e-4cbb-8253-ccfdd2301a6f">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="00a652bd-5301-4c87-a419-279bc11c177b">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="bdbd66a1-8b92-432b-b1c9-89503249e182">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="e75c3382-5cf9-457f-a60c-6b7d2967a9fc">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="54daf256-8f9b-4a3f-8ac4-8a2a1c2ce18d">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="14f5e920-a8b9-4eca-9656-29370043383d">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="084ffede-c411-4e66-a196-cb49db10527b">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="bc407389-7470-4040-899e-e5830e791665">
      <name>Помещение</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СкладскиеПомещения</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="d6817206-55c3-40dd-b445-6fef11a58bc8">
      <name>Продавец</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="b96a2357-c2d0-4bb1-8161-fded35ecdaf8">
      <name>НоменклатураЕГАИС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e720dc89-faab-49d5-a027-c99498210b33">
    <name>ОплатаПлатежнымиКартами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c41bcad7-04bb-4985-aed0-64b49289a271">
      <name>ЭквайринговыйТерминал</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ЭквайринговыеТерминалы</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="c4dd5022-6c57-4c84-b8c7-16fbb22c0977">
      <name>ОплатаОтменена</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="117ee2e5-3f7c-4005-8efa-9514d9d78296">
      <name>НомерПлатежнойКарты</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>22</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="759fb9c5-f07f-4fe3-9a93-b32d516a17a6">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="b05055a3-765b-47d9-9305-3799cea08c90">
      <name>КодАвторизации</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="2928c12f-96cd-405a-9d99-2bd4d1fde8a3">
      <name>СсылочныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="3eea9abb-6bd1-46ac-a6c7-0b36648d29e0">
      <name>НомерЧекаЭТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="fb6038d6-6403-43c3-9a69-4fa09cc91b3f">
    <name>БонусныеБаллы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9dad97c9-b3c8-4726-9f26-cb8a6dfc7e62">
      <name>БонуснаяПрограммаЛояльности</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.БонусныеПрограммыЛояльности</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="d7839726-5f51-44d1-9224-7e1815b35acf">
      <name>ДатаНачисления</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="5ab89269-ea6e-48e4-8725-962cf850281c">
      <name>ДатаСписания</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="ccb05960-0b05-4ba9-aae5-2461d99eb01f">
      <name>СуммаБонусныхБаллов</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="fdd081e1-37e3-414b-9993-d92075525f48">
    <name>АкцизныеМарки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ca06ef49-7aed-4a1c-8ab6-4037c20259fe">
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="fafd444b-67ee-42fb-8643-1c2c39d6317b">
      <name>АкцизнаяМарка</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="313dd1bd-6bf2-47b3-8a9c-a832b4c4e232">
      <name>Справка2</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Справки2ЕГАИС</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="d2fd8ea6-6196-4ca9-8bd8-10fec609928f">
      <name>ШтрихкодУпаковки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="a5990c66-0430-424d-9e65-c901526f7fad">
      <name>КодАкцизнойМарки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>68</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_11_4.Umico/src/CommonModules/РозничныеПродажи/Module.bsl
// @strict-types

#Область ПрограммныйИнтерфейс

&Вместо("ЗаполнитьОтчетОРозничныхПродажах")
// ИзменениеИКонтроль не используется по причине нестабильности.
//@skip-check extension-variable-prefix
//@skip-check object-deprecated
//@skip-check reading-attribute-from-database
//@skip-check common-module-named-self-reference
//@skip-check structure-consructor-value-type
//@skip-check statement-type-change
//@skip-check property-return-type
//@skip-check invocation-parameter-type-intersect
Функция UMC_ЗаполнитьОтчетОРозничныхПродажах(ОтчетОРозничныхПродажахОбъект, КассоваяСмена, ОписаниеОшибки) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	// Заполнение отчета о розничных продажах
	Попытка

		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

		// Подготовка данных.
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Ложь								   КАК Коррекция,
		|	ЧекККМТовары.Ссылка                    КАК Ссылка,
		|	ЧекККМТовары.КлючСвязи                 КАК КлючСвязи,
		|	ЧекККМТовары.НоменклатураНабора        КАК НоменклатураНабора,
		|	ЧекККМТовары.ХарактеристикаНабора      КАК ХарактеристикаНабора,
		|	ЧекККМТовары.Номенклатура              КАК Номенклатура,
		|	ЧекККМТовары.Характеристика            КАК Характеристика,
		|	ЧекККМТовары.Серия                     КАК Серия,
		|	ЧекККМТовары.Упаковка                  КАК Упаковка,
		|	ВЫРАЗИТЬ(ВЫБОР
		|		КОГДА
		|			ЧекККМТовары.СуммаРучнойСкидки + ЧекККМТовары.СуммаАвтоматическойСкидки = 0
		|			ИЛИ ЧекККМТовары.КоличествоУпаковок = 0
		|		ТОГДА
		|			ЧекККМТовары.Цена
		|		ИНАЧЕ
		|			ЧекККМТовары.Сумма / ЧекККМТовары.КоличествоУпаковок
		|	КОНЕЦ КАК Число(15,2)) КАК Цена,
		|	ЧекККМТовары.СтавкаНДС                 КАК СтавкаНДС,
		|	ЧекККМТовары.КоличествоУпаковок        КАК КоличествоУпаковок,
		|	ЧекККМТовары.Количество                КАК Количество,
		|	ЧекККМТовары.Сумма                     КАК Сумма,
		|	ЧекККМТовары.СуммаНДС                  КАК СуммаНДС,
		|	ЧекККМТовары.Ссылка.Склад              КАК Склад,
		|	ЧекККМТовары.Ссылка.Партнер            КАК Партнер,
		|	ЧекККМТовары.Помещение                 КАК Помещение,
		|	ЧекККМТовары.Продавец                  КАК Продавец,
		|	ЧекККМТовары.Ссылка.Валюта             КАК Валюта,
		|	ЧекККМТовары.Ссылка.ВидЦены            КАК ВидЦены,
		|	ЧекККМТовары.Ссылка.КассаККМ           КАК КассаККМ,
		|	ЧекККМТовары.Ссылка.Организация        КАК Организация,
		|	ЧекККМТовары.Ссылка.НалогообложениеНДС КАК НалогообложениеНДС
		|
		|ПОМЕСТИТЬ Товары
		|
		|ИЗ
		|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
		|ГДЕ
		|	ЧекККМТовары.Ссылка.КассоваяСмена = &КассоваяСмена
		|	И ЧекККМТовары.Ссылка.Проведен
		|	И ЧекККМТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Ложь,
		|	ЧекККМТовары.Ссылка,
		|	0,
		|	ЧекККМТовары.НоменклатураНабора,
		|	ЧекККМТовары.ХарактеристикаНабора,
		|	ЧекККМТовары.Номенклатура,
		|	ЧекККМТовары.Характеристика,
		|	ЧекККМТовары.Серия,
		|	ЧекККМТовары.Упаковка,
		|	ЧекККМТовары.Цена,
		|	ЧекККМТовары.СтавкаНДС,
		|	-ЧекККМТовары.КоличествоУпаковок,
		|	-ЧекККМТовары.Количество,
		|	-ЧекККМТовары.Сумма,
		|	-ЧекККМТовары.СуммаНДС,
		|	ЧекККМТовары.Ссылка.Склад,
		|	ЧекККМТовары.Ссылка.Партнер,
		|	ЧекККМТовары.Помещение,
		|	ЧекККМТовары.Продавец,
		|	ЧекККМТовары.Ссылка.Валюта,
		|	ЧекККМТовары.Ссылка.ВидЦены,
		|	ЧекККМТовары.Ссылка.КассаККМ,
		|	ЧекККМТовары.Ссылка.Организация,
		|	ЧекККМТовары.Ссылка.НалогообложениеНДС
		|ИЗ
		|	Документ.ЧекККМВозврат.Товары КАК ЧекККМТовары
		|ГДЕ
		|	ЧекККМТовары.Ссылка.КассоваяСмена = &КассоваяСмена
		|	И ЧекККМТовары.Ссылка.Проведен
		|	И ЧекККМТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Истина,
		|	ЧекККМТовары.Ссылка,
		|	ЧекККМТовары.КлючСвязи,
		|	ЧекККМТовары.НоменклатураНабора,
		|	ЧекККМТовары.ХарактеристикаНабора,
		|	ЧекККМТовары.Номенклатура,
		|	ЧекККМТовары.Характеристика,
		|	ЧекККМТовары.Серия,
		|	ЧекККМТовары.Упаковка,
		|	ВЫРАЗИТЬ(ВЫБОР
		|		КОГДА
		|			ЧекККМТовары.СуммаРучнойСкидки + ЧекККМТовары.СуммаАвтоматическойСкидки = 0
		|			ИЛИ ЧекККМТовары.КоличествоУпаковок = 0
		|		ТОГДА
		|			ЧекККМТовары.Цена
		|		ИНАЧЕ
		|			ЧекККМТовары.Сумма / ЧекККМТовары.КоличествоУпаковок
		|	КОНЕЦ КАК Число(15,2)),
		|	ЧекККМТовары.СтавкаНДС,
		|	-ЧекККМТовары.КоличествоУпаковок,
		|	-ЧекККМТовары.Количество,
		|	-ЧекККМТовары.Сумма,
		|	-ЧекККМТовары.СуммаНДС,
		|	ЧекККМТовары.Ссылка.Склад,
		|	ЧекККМТовары.Ссылка.Партнер,
		|	ЧекККМТовары.Помещение,
		|	ЧекККМТовары.Продавец,
		|	ЧекККМТовары.Ссылка.Валюта,
		|	ЧекККМТовары.Ссылка.ВидЦены,
		|	ЧекККМТовары.Ссылка.КассаККМ,
		|	ЧекККМТовары.Ссылка.Организация,
		|	ЧекККМТовары.Ссылка.НалогообложениеНДС
		|ИЗ
		|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМКоррекции КАК ЧекККМКоррекции
		|		ПО ЧекККМКоррекции.ЧекККМ = ЧекККМТовары.Ссылка
		|			И ЧекККМКоррекции.КассоваяСмена = &КассоваяСмена
		|			И ЧекККМКоррекции.Проведен
		|			И ЧекККМКоррекции.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Истина,
		|	ЧекККМТовары.Ссылка,
		|	0,
		|	ЧекККМТовары.НоменклатураНабора,
		|	ЧекККМТовары.ХарактеристикаНабора,
		|	ЧекККМТовары.Номенклатура,
		|	ЧекККМТовары.Характеристика,
		|	ЧекККМТовары.Серия,
		|	ЧекККМТовары.Упаковка,
		|	ЧекККМТовары.Цена,
		|	ЧекККМТовары.СтавкаНДС,
		|	ЧекККМТовары.КоличествоУпаковок,
		|	ЧекККМТовары.Количество,
		|	ЧекККМТовары.Сумма,
		|	ЧекККМТовары.СуммаНДС,
		|	ЧекККМТовары.Ссылка.Склад,
		|	ЧекККМТовары.Ссылка.Партнер,
		|	ЧекККМТовары.Помещение,
		|	ЧекККМТовары.Продавец,
		|	ЧекККМТовары.Ссылка.Валюта,
		|	ЧекККМТовары.Ссылка.ВидЦены,
		|	ЧекККМТовары.Ссылка.КассаККМ,
		|	ЧекККМТовары.Ссылка.Организация,
		|	ЧекККМТовары.Ссылка.НалогообложениеНДС
		|ИЗ
		|	Документ.ЧекККМКоррекции.Товары КАК ЧекККМТовары
		|ГДЕ
		|	ЧекККМТовары.Ссылка.КассоваяСмена = &КассоваяСмена
		|	И ЧекККМТовары.Ссылка.Проведен
		|	И ЧекККМТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЧекККМТовары.Коррекция			КАК Коррекция,
		|	ЧекККМТовары.Ссылка               КАК Ссылка,
		|	ЧекККМТовары.НоменклатураНабора   КАК НоменклатураНабора,
		|	ЧекККМТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ЧекККМТовары.Номенклатура       КАК Номенклатура,
		|	ЧекККМТовары.Характеристика     КАК Характеристика,
		|	ЧекККМТовары.Серия              КАК Серия,
		|	ЧекККМТовары.Упаковка           КАК Упаковка,
		|	ЧекККМТовары.Цена               КАК Цена,
		|	ЧекККМТовары.СтавкаНДС          КАК СтавкаНДС,
		|	ЧекККМТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЧекККМТовары.Количество         КАК Количество,
		|	ЧекККМТовары.Сумма              КАК Сумма,
		|	ЧекККМТовары.СуммаНДС           КАК СуммаНДС,
		|	ЧекККМТовары.Склад              КАК Склад,
		|	ЧекККМТовары.Партнер            КАК Партнер,
		|	ЧекККМТовары.Помещение          КАК Помещение,
		|	ЧекККМТовары.Продавец           КАК Продавец,
		|	ЧекККМТовары.Валюта             КАК Валюта,
		|	ЧекККМТовары.ВидЦены            КАК ВидЦены,
		|	ЧекККМТовары.КассаККМ           КАК КассаККМ,
		|	ЧекККМТовары.Организация        КАК Организация,
		|	ЧекККМТовары.НалогообложениеНДС КАК НалогообложениеНДС
		|
		|ПОМЕСТИТЬ СписокТоваров
		|ИЗ
		|	Товары КАК ЧекККМТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокТоваров.Коррекция,
		|	СписокТоваров.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ЧекиККМ
		|ИЗ
		|	СписокТоваров КАК СписокТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЧекиККМ.Ссылка КАК Ссылка
		|ИЗ
		|	ЧекиККМ КАК ЧекиККМ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокТоваров.Валюта КАК Валюта,
		|	СписокТоваров.ВидЦены КАК ВидЦены,
		|	СписокТоваров.КассаККМ КАК КассаККМ,
		|	СписокТоваров.Организация КАК Организация,
		|	СписокТоваров.НалогообложениеНДС КАК НалогообложениеНДС,
		|	СписокТоваров.Склад КАК Склад
		|ИЗ
		|	СписокТоваров КАК СписокТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокТоваров.НоменклатураНабора   КАК НоменклатураНабора,
		|	СписокТоваров.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	СписокТоваров.Номенклатура КАК Номенклатура,
		|	СписокТоваров.Характеристика КАК Характеристика,
		|	СписокТоваров.Серия КАК Серия,
		|	СписокТоваров.Упаковка КАК Упаковка,
		|	СписокТоваров.Цена КАК Цена,
		|	СписокТоваров.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	СписокТоваров КАК СписокТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КассоваяСмена.ОкончаниеКассовойСмены КАК ОкончаниеКассовойСмены
		|ИЗ
		|	Документ.КассоваяСмена КАК КассоваяСмена
		|ГДЕ КассоваяСмена.Ссылка = &КассоваяСмена
		|";

		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		МассивРезультатов = Запрос.ВыполнитьПакет();

		// Формирование таблиц индексов по аналитике и номенклатуре
		ТаблицаИндексовПоАналитике = МассивРезультатов[4].Выгрузить();
		ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ТаблицаИндексовПоАналитике,"Индекс");

		ТаблицаИндексовПоНоменклатуре = МассивРезультатов[5].Выгрузить();
		ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ТаблицаИндексовПоНоменклатуре,"Индекс");

		ВыборкаРеквизитыКассовойСмены = МассивРезультатов[6].Выбрать();
		ВыборкаРеквизитыКассовойСмены.Следующий();

		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаИндексов.Индекс КАК ИндексПоАналитике,
		|	ТаблицаИндексов.Валюта КАК Валюта,
		|	ТаблицаИндексов.ВидЦены КАК ВидЦены,
		|	ТаблицаИндексов.КассаККМ КАК КассаККМ,
		|	ТаблицаИндексов.Организация КАК Организация,
		|	ТаблицаИндексов.НалогообложениеНДС КАК НалогообложениеНДС,
		|	ТаблицаИндексов.Склад КАК Склад
		|ПОМЕСТИТЬ ИндексыПоАналитике
		|ИЗ
		|	&ТаблицаИндексовПоАналитике КАК ТаблицаИндексов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Валюта,
		|	ВидЦены,
		|	КассаККМ,
		|	Организация,
		|	НалогообложениеНДС,
		|	Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаИндексов.Индекс КАК ИндексПоНоменклатуре,
		|	ТаблицаИндексов.НоменклатураНабора   КАК НоменклатураНабора,
		|	ТаблицаИндексов.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ТаблицаИндексов.Номенклатура КАК Номенклатура,
		|	ТаблицаИндексов.Характеристика КАК Характеристика,
		|	ТаблицаИндексов.Серия КАК Серия,
		|	ТаблицаИндексов.Упаковка КАК Упаковка,
		|	ТаблицаИндексов.Цена КАК Цена,
		|	ТаблицаИндексов.СтавкаНДС КАК СтавкаНДС
		|ПОМЕСТИТЬ ИндексыПоНоменклатуре
		|ИЗ
		|	&ТаблицаИндексовПоНоменклатуре КАК ТаблицаИндексов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НоменклатураНабора,
		|	ХарактеристикаНабора,
		|	Номенклатура,
		|	Характеристика,
		|	Серия,
		|	Упаковка,
		|	Цена,
		|	СтавкаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокТоваров.НоменклатураНабора   КАК НоменклатураНабора,
		|	СписокТоваров.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	СписокТоваров.Номенклатура КАК Номенклатура,
		|	СписокТоваров.Характеристика КАК Характеристика,
		|	СписокТоваров.Серия КАК Серия,
		|	СписокТоваров.Упаковка КАК Упаковка,
		|	СписокТоваров.Цена КАК Цена,
		|	СписокТоваров.Партнер КАК Партнер,
		|	СписокТоваров.Помещение КАК Помещение,
		|	СписокТоваров.Продавец КАК Продавец,
		|	СписокТоваров.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(СписокТоваров.КоличествоУпаковок) КАК КоличествоУпаковок,
		|	СУММА(СписокТоваров.Количество) КАК Количество,
		|	СУММА(СписокТоваров.Сумма) КАК Сумма,
		|	СУММА(СписокТоваров.СуммаНДС) КАК СуммаНДС,
		|	ИндексыПоАналитике.ИндексПоАналитике КАК ИндексПоАналитике,
		|	ИндексыПоНоменклатуре.ИндексПоНоменклатуре КАК ИндексПоНоменклатуре,
		|	СписокТоваров.Склад КАК Склад,
		|	СписокТоваров.Валюта КАК Валюта,
		|	СписокТоваров.ВидЦены КАК ВидЦены,
		|	СписокТоваров.КассаККМ КАК КассаККМ,
		|	СписокТоваров.Организация КАК Организация,
		|	СписокТоваров.НалогообложениеНДС КАК НалогообложениеНДС
		|ИЗ
		|	(ВЫБРАТЬ
		|		СписокТоваров.НоменклатураНабора   КАК НоменклатураНабора,
		|		СписокТоваров.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|		СписокТоваров.Номенклатура КАК Номенклатура,
		|		СписокТоваров.Характеристика КАК Характеристика,
		|		СписокТоваров.Серия КАК Серия,
		|		СписокТоваров.Упаковка КАК Упаковка,
		|		СписокТоваров.Цена КАК Цена,
		|		СписокТоваров.Партнер КАК Партнер,
		|		СписокТоваров.Помещение КАК Помещение,
		|		СписокТоваров.Продавец КАК Продавец,
		|		СписокТоваров.СтавкаНДС КАК СтавкаНДС,
		|		СписокТоваров.КоличествоУпаковок КАК КоличествоУпаковок,
		|		СписокТоваров.Количество КАК Количество,
		|		СписокТоваров.Сумма КАК Сумма,
		|		СписокТоваров.СуммаНДС КАК СуммаНДС,
		|		СписокТоваров.Склад КАК Склад,
		|		СписокТоваров.Валюта КАК Валюта,
		|		СписокТоваров.ВидЦены КАК ВидЦены,
		|		СписокТоваров.КассаККМ КАК КассаККМ,
		|		СписокТоваров.Организация КАК Организация,
		|		СписокТоваров.НалогообложениеНДС КАК НалогообложениеНДС
		|	ИЗ
		|		СписокТоваров КАК СписокТоваров) КАК СписокТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО СписокТоваров.Склад = ИндексыПоАналитике.Склад
		|			И СписокТоваров.Валюта = ИндексыПоАналитике.Валюта
		|			И СписокТоваров.ВидЦены = ИндексыПоАналитике.ВидЦены
		|			И СписокТоваров.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И СписокТоваров.Организация = ИндексыПоАналитике.Организация
		|			И СписокТоваров.НалогообложениеНДС = ИндексыПоАналитике.НалогообложениеНДС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоНоменклатуре КАК ИндексыПоНоменклатуре
		|		ПО СписокТоваров.Номенклатура = ИндексыПоНоменклатуре.Номенклатура
		|			И СписокТоваров.НоменклатураНабора = ИндексыПоНоменклатуре.НоменклатураНабора
		|			И СписокТоваров.ХарактеристикаНабора = ИндексыПоНоменклатуре.ХарактеристикаНабора
		|			И СписокТоваров.Характеристика = ИндексыПоНоменклатуре.Характеристика
		|			И СписокТоваров.Серия = ИндексыПоНоменклатуре.Серия
		|			И СписокТоваров.Упаковка = ИндексыПоНоменклатуре.Упаковка
		|			И СписокТоваров.Цена = ИндексыПоНоменклатуре.Цена
		|			И СписокТоваров.СтавкаНДС = ИндексыПоНоменклатуре.СтавкаНДС
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокТоваров.НоменклатураНабора,
		|	СписокТоваров.ХарактеристикаНабора,
		|	СписокТоваров.Номенклатура,
		|	СписокТоваров.Характеристика,
		|	СписокТоваров.Серия,
		|	СписокТоваров.СтавкаНДС,
		|	СписокТоваров.Упаковка,
		|	СписокТоваров.Цена,
		|	СписокТоваров.Партнер,
		|	СписокТоваров.Помещение,
		|	СписокТоваров.Продавец,
		|	ИндексыПоНоменклатуре.СтавкаНДС,
		|	ИндексыПоАналитике.ИндексПоАналитике,
		|	ИндексыПоНоменклатуре.ИндексПоНоменклатуре,
		|	СписокТоваров.Склад,
		|	СписокТоваров.Валюта,
		|	СписокТоваров.ВидЦены,
		|	СписокТоваров.КассаККМ,
		|	СписокТоваров.Организация,
		|	СписокТоваров.НалогообложениеНДС
		|ИТОГИ
		|	МАКСИМУМ(НоменклатураНабора),
		|	МАКСИМУМ(ХарактеристикаНабора),
		|	МАКСИМУМ(Номенклатура),
		|	МАКСИМУМ(Характеристика),
		|	МАКСИМУМ(Серия),
		|	МАКСИМУМ(Упаковка),
		|	МАКСИМУМ(Цена),
		|	МАКСИМУМ(Партнер),
		|	МАКСИМУМ(Помещение),
		|	МАКСИМУМ(Продавец),
		|	МАКСИМУМ(СтавкаНДС),
		|	МАКСИМУМ(КоличествоУпаковок),
		|	МАКСИМУМ(Количество),
		|	МАКСИМУМ(Сумма),
		|	МАКСИМУМ(СуммаНДС),
		|	МАКСИМУМ(Склад),
		|	МАКСИМУМ(Валюта),
		|	МАКСИМУМ(ВидЦены),
		|	МАКСИМУМ(КассаККМ),
		|	МАКСИМУМ(Организация),
		|	МАКСИМУМ(НалогообложениеНДС)
		|ПО
		|	ИндексПоАналитике,
		|	ИндексПоНоменклатуре
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
//		|	ОплатаПлатежнымиКартами.Ссылка КАК Ссылка,
		|	ОплатаПлатежнымиКартами.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
		|	ОплатаПлатежнымиКартами.НомерПлатежнойКарты КАК НомерПлатежнойКарты,
		|	ОплатаПлатежнымиКартами.КодАвторизации КАК КодАвторизации,
		|	СУММА(ОплатаПлатежнымиКартами.Сумма) КАК Сумма,
		|	ИндексыПоАналитике.ИндексПоАналитике КАК ИндексПоАналитике
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЧекККМОплатаПлатежнымиКартами.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
		|		ЧекККМОплатаПлатежнымиКартами.НомерПлатежнойКарты КАК НомерПлатежнойКарты,
		|		ЧекККМОплатаПлатежнымиКартами.КодАвторизации КАК КодАвторизации,
		|		ЧекККМОплатаПлатежнымиКартами.Сумма КАК Сумма,
		|		ЧекККМОплатаПлатежнымиКартами.Ссылка.КассаККМ КАК КассаККМ,
		|		ЧекККМОплатаПлатежнымиКартами.Ссылка.Организация КАК Организация,
		|		ЧекККМОплатаПлатежнымиКартами.Ссылка.Склад КАК Склад,
		|		ЧекККМОплатаПлатежнымиКартами.Ссылка.Валюта КАК Валюта,
		|		ЧекККМОплатаПлатежнымиКартами.Ссылка.ВидЦены КАК ВидЦены
		|	ИЗ
		|		Документ.ЧекККМ.ОплатаПлатежнымиКартами КАК ЧекККМОплатаПлатежнымиКартами
		|	ГДЕ
		|		ЧекККМОплатаПлатежнымиКартами.Ссылка В
		|				(ВЫБРАТЬ
		|					ЧекиККМ.Ссылка
		|				ИЗ
		|					ЧекиККМ КАК ЧекиККМ
		|				ГДЕ
		|					ЧекиККМ.Коррекция = ЛОЖЬ)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ЧекККМВозвратОплатаПлатежнымиКартами.ЭквайринговыйТерминал,
		|		ЧекККМВозвратОплатаПлатежнымиКартами.НомерПлатежнойКарты,
		|		ЧекККМВозвратОплатаПлатежнымиКартами.КодАвторизации,
		|		-ЧекККМВозвратОплатаПлатежнымиКартами.Сумма,
		|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.КассаККМ,
		|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.Организация,
		|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.Склад,
		|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.Валюта,
		|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.ВидЦены
		|	ИЗ
		|		Документ.ЧекККМВозврат.ОплатаПлатежнымиКартами КАК ЧекККМВозвратОплатаПлатежнымиКартами
		|	ГДЕ
		|		ЧекККМВозвратОплатаПлатежнымиКартами.ОплатаОтменена
		|		И ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка В
		|				(ВЫБРАТЬ
		|					ЧекиККМ.Ссылка
		|				ИЗ
		|					ЧекиККМ КАК ЧекиККМ)) КАК ОплатаПлатежнымиКартами
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО ОплатаПлатежнымиКартами.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И ОплатаПлатежнымиКартами.Организация = ИндексыПоАналитике.Организация
		|			И ОплатаПлатежнымиКартами.Склад = ИндексыПоАналитике.Склад
		|			И ОплатаПлатежнымиКартами.Валюта = ИндексыПоАналитике.Валюта
		|			И ОплатаПлатежнымиКартами.ВидЦены = ИндексыПоАналитике.ВидЦены
		|СГРУППИРОВАТЬ ПО
		|	ОплатаПлатежнымиКартами.ЭквайринговыйТерминал,
		|	ОплатаПлатежнымиКартами.НомерПлатежнойКарты,
		|	ОплатаПлатежнымиКартами.КодАвторизации,
		|	ИндексыПоАналитике.ИндексПоАналитике
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Серии.Помещение                      КАК Помещение,
		|	Серии.Серия                          КАК Серия,
		|	Серии.Номенклатура                   КАК Номенклатура,
		|	Серии.Характеристика                 КАК Характеристика,
		|	СУММА(Серии.Количество)              КАК Количество,
		|	ИндексыПоАналитике.ИндексПоАналитике КАК ИндексПоАналитике
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЧекККМСерии.Помещение КАК Помещение,
		|		ЧекККМСерии.Серия КАК Серия,
		|		ЧекККМСерии.Номенклатура КАК Номенклатура,
		|		ЧекККМСерии.Характеристика КАК Характеристика,
		|		ЧекККМСерии.Количество КАК Количество,
		|		ЧекККМСерии.Ссылка.КассаККМ КАК КассаККМ,
		|		ЧекККМСерии.Ссылка.Организация КАК Организация,
		|		ЧекККМСерии.Ссылка.Склад КАК Склад,
		|		ЧекККМСерии.Ссылка.Валюта КАК Валюта,
		|		ЧекККМСерии.Ссылка.ВидЦены КАК ВидЦены
		|	ИЗ
		|		Документ.ЧекККМ.Серии КАК ЧекККМСерии
		|	ГДЕ
		|		ЧекККМСерии.Ссылка В
		|				(ВЫБРАТЬ
		|					ЧекиККМ.Ссылка
		|				ИЗ
		|					ЧекиККМ КАК ЧекиККМ
		|				ГДЕ
		|					ЧекиККМ.Коррекция = Ложь)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ЧекККМВозвратСерии.Помещение,
		|		ЧекККМВозвратСерии.Серия,
		|		ЧекККМВозвратСерии.Номенклатура,
		|		ЧекККМВозвратСерии.Характеристика,
		|		-ЧекККМВозвратСерии.Количество,
		|		ЧекККМВозвратСерии.Ссылка.КассаККМ,
		|		ЧекККМВозвратСерии.Ссылка.Организация,
		|		ЧекККМВозвратСерии.Ссылка.Склад,
		|		ЧекККМВозвратСерии.Ссылка.Валюта,
		|		ЧекККМВозвратСерии.Ссылка.ВидЦены
		|	ИЗ
		|		Документ.ЧекККМВозврат.Серии КАК ЧекККМВозвратСерии
		|	ГДЕ
		|		ЧекККМВозвратСерии.Ссылка В
		|				(ВЫБРАТЬ
		|					ЧекиККМ.Ссылка
		|				ИЗ
		|					ЧекиККМ КАК ЧекиККМ
		|				ГДЕ
		|					ЧекиККМ.Коррекция = Ложь)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ЧекККМСерии.Помещение КАК Помещение,
		|		ЧекККМСерии.Серия КАК Серия,
		|		ЧекККМСерии.Номенклатура КАК Номенклатура,
		|		ЧекККМСерии.Характеристика КАК Характеристика,
		|		ЧекККМСерии.Количество КАК Количество,
		|		ЧекККМСерии.Ссылка.КассаККМ КАК КассаККМ,
		|		ЧекККМСерии.Ссылка.Организация КАК Организация,
		|		ЧекККМСерии.Ссылка.Склад КАК Склад,
		|		ЧекККМСерии.Ссылка.Валюта КАК Валюта,
		|		ЧекККМСерии.Ссылка.ВидЦены КАК ВидЦены
		|	ИЗ
		|		Документ.ЧекККМ.Серии КАК ЧекККМСерии
		|	ГДЕ
		|		ЧекККМСерии.Ссылка В
		|				(ВЫБРАТЬ
		|					ЧекиККМ.Ссылка
		|				ИЗ
		|					ЧекиККМ КАК ЧекиККМ
		|				ГДЕ
		|					ЧекиККМ.Коррекция = Истина)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ЧекККМКоррекцииСерии.Помещение КАК Помещение,
		|		ЧекККМКоррекцииСерии.Серия КАК Серия,
		|		ЧекККМКоррекцииСерии.Номенклатура КАК Номенклатура,
		|		ЧекККМКоррекцииСерии.Характеристика КАК Характеристика,
		|		ЧекККМКоррекцииСерии.Количество КАК Количество,
		|		ЧекККМКоррекцииСерии.Ссылка.КассаККМ КАК КассаККМ,
		|		ЧекККМКоррекцииСерии.Ссылка.Организация КАК Организация,
		|		ЧекККМКоррекцииСерии.Ссылка.Склад КАК Склад,
		|		ЧекККМКоррекцииСерии.Ссылка.Валюта КАК Валюта,
		|		ЧекККМКоррекцииСерии.Ссылка.ВидЦены КАК ВидЦены
		|	ИЗ
		|		Документ.ЧекККМКоррекции.Серии КАК ЧекККМКоррекцииСерии
		|	ГДЕ
		|		ЧекККМКоррекцииСерии.Ссылка В
		|				(ВЫБРАТЬ
		|					ЧекиККМ.Ссылка
		|				ИЗ
		|					ЧекиККМ КАК ЧекиККМ
		|				ГДЕ
		|					ЧекиККМ.Коррекция = Истина)
		|) КАК Серии
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО Серии.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И Серии.Организация = ИндексыПоАналитике.Организация
		|			И Серии.Склад = ИндексыПоАналитике.Склад
		|			И Серии.Валюта = ИндексыПоАналитике.Валюта
		|			И Серии.ВидЦены = ИндексыПоАналитике.ВидЦены
		|СГРУППИРОВАТЬ ПО
		|	Серии.Помещение,
		|	Серии.Серия,
		|	Серии.Номенклатура,
		|	Серии.Характеристика,
		|	ИндексыПоАналитике.ИндексПоАналитике
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодарочныеСертификаты.ПодарочныйСертификат           КАК ПодарочныйСертификат,
		|	СУММА(ПодарочныеСертификаты.Количество)              КАК Количество,
		|	СУММА(ПодарочныеСертификаты.Сумма)                   КАК Сумма,
		|	СУММА(ПодарочныеСертификаты.СуммаВВалютеСертификата) КАК СуммаВВалютеСертификата,
		|	ИндексыПоАналитике.ИндексПоАналитике                 КАК ИндексПоАналитике
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЧекККМПодарочныеСертификаты.ПодарочныйСертификат    КАК ПодарочныйСертификат,
		|		1                                                   КАК Количество,
		|		ЧекККМПодарочныеСертификаты.Сумма                   КАК Сумма,
		|		ЧекККМПодарочныеСертификаты.СуммаВВалютеСертификата КАК СуммаВВалютеСертификата,
		|		ЧекККМПодарочныеСертификаты.Ссылка.КассаККМ КАК КассаККМ,
		|		ЧекККМПодарочныеСертификаты.Ссылка.Организация КАК Организация,
		|		ЧекККМПодарочныеСертификаты.Ссылка.Склад КАК Склад,
		|		ЧекККМПодарочныеСертификаты.Ссылка.Валюта КАК Валюта,
		|		ЧекККМПодарочныеСертификаты.Ссылка.ВидЦены КАК ВидЦены
		|	ИЗ
		|		Документ.ЧекККМ.ПодарочныеСертификаты КАК ЧекККМПодарочныеСертификаты
		|	ГДЕ
		|		ЧекККМПодарочныеСертификаты.Ссылка В
		|				(ВЫБРАТЬ
		|					ЧекиККМ.Ссылка
		|				ИЗ
		|					ЧекиККМ КАК ЧекиККМ
		|				ГДЕ
		|					ЧекиККМ.Коррекция = ЛОЖЬ)) КАК ПодарочныеСертификаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО ПодарочныеСертификаты.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И ПодарочныеСертификаты.Организация = ИндексыПоАналитике.Организация
		|			И ПодарочныеСертификаты.Склад = ИндексыПоАналитике.Склад
		|			И ПодарочныеСертификаты.Валюта = ИндексыПоАналитике.Валюта
		|			И ПодарочныеСертификаты.ВидЦены = ИндексыПоАналитике.ВидЦены
		|СГРУППИРОВАТЬ ПО
		|	ПодарочныеСертификаты.ПодарочныйСертификат,
		|	ИндексыПоАналитике.ИндексПоАналитике
		|ИМЕЮЩИЕ(СУММА(ПодарочныеСертификаты.Количество) <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИндексыПоАналитике.ИндексПоАналитике          КАК ИндексПоАналитике,
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности     КАК БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.ДатаНачисления                  КАК ДатаНачисления,
		|	БонусныеБаллы.ДатаСписания                    КАК ДатаСписания,
		|	БонусныеБаллы.Партнер                         КАК Партнер,
		|	СУММА(БонусныеБаллы.СуммаБонусныхБаллов)      КАК СуммаБонусныхБаллов
		|ИЗ
		|(
		|ВЫБРАТЬ
		|	БонусныеБаллы.Ссылка.КассаККМ    КАК КассаККМ,
		|	БонусныеБаллы.Ссылка.Организация КАК Организация,
		|	БонусныеБаллы.Ссылка.Склад       КАК Склад,
		|	БонусныеБаллы.Ссылка.Валюта      КАК Валюта,
		|	БонусныеБаллы.Ссылка.ВидЦены     КАК ВидЦены,
		|	БонусныеБаллы.Ссылка.Партнер     КАК Партнер,

		|	БонусныеБаллы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.ДатаНачисления              КАК ДатаНачисления,
		|	БонусныеБаллы.ДатаСписания                КАК ДатаСписания,
		|	БонусныеБаллы.СуммаБонусныхБаллов         КАК СуммаБонусныхБаллов
		|ИЗ
		|	Документ.ЧекККМ.БонусныеБаллы КАК БонусныеБаллы
		|ГДЕ
		|	БонусныеБаллы.Ссылка В
		|			(ВЫБРАТЬ
		|				ЧекиККМ.Ссылка
		|			ИЗ
		|				ЧекиККМ КАК ЧекиККМ
		|			ГДЕ
		|				ЧекиККМ.Коррекция = ЛОЖЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БонусныеБаллы.Ссылка.КассаККМ    КАК КассаККМ,
		|	БонусныеБаллы.Ссылка.Организация КАК Организация,
		|	БонусныеБаллы.Ссылка.Склад       КАК Склад,
		|	БонусныеБаллы.Ссылка.Валюта      КАК Валюта,
		|	БонусныеБаллы.Ссылка.ВидЦены     КАК ВидЦены,
		|	БонусныеБаллы.Ссылка.Партнер     КАК Партнер,

		|	БонусныеБаллы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.ДатаНачисления              КАК ДатаНачисления,
		|	БонусныеБаллы.ДатаСписания                КАК ДатаСписания,
		|	-БонусныеБаллы.СуммаБонусныхБаллов        КАК СуммаБонусныхБаллов
		|ИЗ
		|	Документ.ЧекККМВозврат.БонусныеБаллы КАК БонусныеБаллы
		|ГДЕ
		|	БонусныеБаллы.Ссылка В
		|			(ВЫБРАТЬ
		|				ЧекиККМ.Ссылка
		|			ИЗ
		|				ЧекиККМ КАК ЧекиККМ)
		|) КАК БонусныеБаллы
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО БонусныеБаллы.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И БонусныеБаллы.Организация = ИндексыПоАналитике.Организация
		|			И БонусныеБаллы.Склад = ИндексыПоАналитике.Склад
		|			И БонусныеБаллы.Валюта = ИндексыПоАналитике.Валюта
		|			И БонусныеБаллы.ВидЦены = ИндексыПоАналитике.ВидЦены
		|СГРУППИРОВАТЬ ПО
		|	ИндексыПоАналитике.ИндексПоАналитике,
		|	БонусныеБаллы.ДатаНачисления,
		|	БонусныеБаллы.ДатаСписания,
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.Партнер
		|ИМЕЮЩИЕ
		|	СУММА(БонусныеБаллы.СуммаБонусныхБаллов) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИндексыПоАналитике.ИндексПоАналитике          КАК ИндексПоАналитике,
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности     КАК БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.ДатаОплаты                  КАК ДатаОплаты,
		|	БонусныеБаллы.Партнер                         КАК Партнер,
		|	СУММА(БонусныеБаллы.СуммаБонусныхБаллов)      КАК СуммаБонусныхБаллов
		|ИЗ
		|(
		|ВЫБРАТЬ
		|	Таблица.Ссылка.КассаККМ    КАК КассаККМ,
		|	Таблица.Ссылка.Организация КАК Организация,
		|	Таблица.Ссылка.Склад       КАК Склад,
		|	Таблица.Ссылка.Валюта      КАК Валюта,
		|	Таблица.Ссылка.ВидЦены     КАК ВидЦены,
		|	Таблица.Ссылка.Партнер     КАК Партнер,
		|
		|	Таблица.Ссылка.КартаЛояльности.Владелец.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	Таблица.Ссылка.Дата                                                 КАК ДатаОплаты,
		|	Таблица.СуммаБонусныхБалловКСписанию                                КАК СуммаБонусныхБаллов
		|ИЗ
		|	Документ.ЧекККМ.Товары КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка В
		|			(ВЫБРАТЬ
		|				ЧекиККМ.Ссылка
		|			ИЗ
		|				ЧекиККМ КАК ЧекиККМ
		|			ГДЕ
		|				ЧекиККМ.Коррекция = ЛОЖЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекККМВозврат.КассаККМ    КАК КассаККМ,
		|	ЧекККМВозврат.Организация КАК Организация,
		|	ЧекККМВозврат.Склад       КАК Склад,
		|	ЧекККМВозврат.Валюта      КАК Валюта,
		|	ЧекККМВозврат.ВидЦены     КАК ВидЦены,
		|	ЧекККМВозврат.Партнер     КАК Партнер,

		|	ЧекККМВозврат.КартаЛояльности.Владелец.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	ЧекККМВозврат.Дата                                                 КАК ДатаОплаты,
		|	-ЧекККМВозврат.СуммаБонусныхБалловКВозврату                        КАК СуммаБонусныхБаллов
		|ИЗ
		|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
		|ГДЕ
		|	БонусныеБаллы.Ссылка В
		|			(ВЫБРАТЬ
		|				ЧекиККМ.Ссылка
		|			ИЗ
		|				ЧекиККМ КАК ЧекиККМ)
		|
		|) КАК БонусныеБаллы
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО БонусныеБаллы.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И БонусныеБаллы.Организация = ИндексыПоАналитике.Организация
		|			И БонусныеБаллы.Склад = ИндексыПоАналитике.Склад
		|			И БонусныеБаллы.Валюта = ИндексыПоАналитике.Валюта
		|			И БонусныеБаллы.ВидЦены = ИндексыПоАналитике.ВидЦены
		|СГРУППИРОВАТЬ ПО
		|	ИндексыПоАналитике.ИндексПоАналитике,
		|	БонусныеБаллы.ДатаОплаты,
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.Партнер
		|ИМЕЮЩИЕ
		|	СУММА(БонусныеБаллы.СуммаБонусныхБаллов) <> 0;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИндексыПоАналитике.ИндексПоАналитике КАК ИндексПоАналитике,
		|	АкцизныеМарки.Справка2               КАК Справка2,
		|	АкцизныеМарки.АкцизнаяМарка          КАК АкцизнаяМарка
		|ИЗ
		|(
		|	ВЫБРАТЬ
		|		Таблица.Ссылка.КассаККМ    КАК КассаККМ,
		|		Таблица.Ссылка.Организация КАК Организация,
		|		Таблица.Ссылка.Склад       КАК Склад,
		|		Таблица.Ссылка.Валюта      КАК Валюта,
		|		Таблица.Ссылка.ВидЦены     КАК ВидЦены,
		|		Таблица.Справка2           КАК Справка2,
		|		Таблица.АкцизнаяМарка      КАК АкцизнаяМарка,
		|		1                          КАК КоличествоАкцизов
		|	ИЗ
		|		Документ.ЧекККМ.АкцизныеМарки КАК Таблица
		|	ГДЕ
		|		Таблица.Ссылка В
		|			(ВЫБРАТЬ
		|				ЧекиККМ.Ссылка
		|			ИЗ
		|				ЧекиККМ КАК ЧекиККМ)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Таблица.Ссылка.КассаККМ    КАК КассаККМ,
		|		Таблица.Ссылка.Организация КАК Организация,
		|		Таблица.Ссылка.Склад       КАК Склад,
		|		Таблица.Ссылка.Валюта      КАК Валюта,
		|		Таблица.Ссылка.ВидЦены     КАК ВидЦены,
		|		Таблица.Справка2           КАК Справка2,
		|		Таблица.АкцизнаяМарка      КАК АкцизнаяМарка,
		|		-1                         КАК КоличествоАкцизов
		|	ИЗ
		|		Документ.ЧекККМВозврат.АкцизныеМарки КАК Таблица
		|	ГДЕ
		|		Таблица.Ссылка В
		|			(ВЫБРАТЬ
		|				ЧекиККМ.Ссылка
		|			ИЗ
		|				ЧекиККМ КАК ЧекиККМ)
		|
		|	) КАК АкцизныеМарки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО АкцизныеМарки.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И АкцизныеМарки.Организация = ИндексыПоАналитике.Организация
		|			И АкцизныеМарки.Склад = ИндексыПоАналитике.Склад
		|			И АкцизныеМарки.Валюта = ИндексыПоАналитике.Валюта
		|			И АкцизныеМарки.ВидЦены = ИндексыПоАналитике.ВидЦены
		|СГРУППИРОВАТЬ ПО
		|	ИндексыПоАналитике.ИндексПоАналитике,
		|	АкцизныеМарки.Справка2,
		|	АкцизныеМарки.АкцизнаяМарка
		|ИМЕЮЩИЕ
		|	СУММА(АкцизныеМарки.КоличествоАкцизов) > 0;
		|";

		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("ТаблицаИндексовПоАналитике", ТаблицаИндексовПоАналитике);
		Запрос.УстановитьПараметр("ТаблицаИндексовПоНоменклатуре", ТаблицаИндексовПоНоменклатуре);

		Результат = Запрос.ВыполнитьПакет();

		ОплатаПлатежнымиКартами = Результат[3].Выгрузить();
		Серии                   = Результат[4].Выгрузить();
		ПодарочныеСертификаты   = Результат[5].Выгрузить();
		БонусныеБаллы           = Результат[6].Выгрузить();
		ОплатаБонуснымиБаллами  = Результат[7].Выгрузить();
		АкцизныеМарки           = Результат[8].Выгрузить();

		ОплатаПлатежнымиКартами.Индексы.Добавить("ИндексПоАналитике");
		Серии.Индексы.Добавить("ИндексПоАналитике");
		ПодарочныеСертификаты.Индексы.Добавить("ИндексПоАналитике");
		БонусныеБаллы.Индексы.Добавить("ИндексПоАналитике");
		ОплатаБонуснымиБаллами.Индексы.Добавить("ИндексПоАналитике");
		АкцизныеМарки.Индексы.Добавить("ИндексПоАналитике");

		ВыборкаПоАналитике = Результат[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Если ВыборкаПоАналитике.Количество() > 1 Тогда
			ВызватьИсключение НСтр("ru = 'По кассовой смене зарегистрировано несколько аналитик. Создание отчета о розничных продажах невозможно'");
		КонецЕсли;

		// Очистим табличные части документа.
		ОтчетОРозничныхПродажахОбъект.Товары.Очистить();
		ОтчетОРозничныхПродажахОбъект.Серии.Очистить();
		ОтчетОРозничныхПродажахОбъект.ОплатаПлатежнымиКартами.Очистить();
		ОтчетОРозничныхПродажахОбъект.ВидыЗапасов.Очистить();
		ОтчетОРозничныхПродажахОбъект.ПодарочныеСертификаты.Очистить();
		ОтчетОРозничныхПродажахОбъект.НачислениеБонусныхБаллов.Очистить();
		ОтчетОРозничныхПродажахОбъект.ОплатаБонуснымиБаллами.Очистить();
		ОтчетОРозничныхПродажахОбъект.АкцизныеМарки.Очистить();
		
		//#Вставка 
		UMC_ДополнитьОтчетОРозничныхПродажахОплатойUmico(ОтчетОРозничныхПродажахОбъект, МенеджерВременныхТаблиц);
		//#КонецВставки
		
		Пока ВыборкаПоАналитике.Следующий() Цикл

			ЗаполнитьЗначенияСвойств(ОтчетОРозничныхПродажахОбъект, ВыборкаПоАналитике);

			ВыборкаПоАналитикеНоменклатуры = ВыборкаПоАналитике.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоАналитикеНоменклатуры.Следующий() Цикл

				ВыборкаДетальныеЗаписи = ВыборкаПоАналитикеНоменклатуры.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

					Если ВыборкаДетальныеЗаписи.Количество <> 0 Тогда

						СтрокаТабличнойЧастиТовары = ОтчетОРозничныхПродажахОбъект.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧастиТовары, ВыборкаДетальныеЗаписи);
						СтрокаТабличнойЧастиТовары.Цена = Окр(СтрокаТабличнойЧастиТовары.Сумма / СтрокаТабличнойЧастиТовары.КоличествоУпаковок, 15, 2);

					КонецЕсли;

				КонецЦикла;

			КонецЦикла;

			// Заполнение табличной части "Оплата платежными картами".
			МассивСтрок = ОплатаПлатежнымиКартами.НайтиСтроки(Новый Структура("ИндексПоАналитике", ВыборкаПоАналитике.ИндексПоАналитике));
			Для Каждого СтрокаТЧ Из МассивСтрок Цикл

				Если СтрокаТЧ.Сумма <> 0 Тогда
					СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.ОплатаПлатежнымиКартами.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
				КонецЕсли;

			КонецЦикла;

			// Заполнение табличной части "Серии".
			МассивСтрок = Серии.НайтиСтроки(Новый Структура("ИндексПоАналитике", ВыборкаПоАналитике.ИндексПоАналитике));
			Для Каждого СтрокаТЧ Из МассивСтрок Цикл

				Если СтрокаТЧ.Количество <> 0 Тогда
					СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.Серии.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
				КонецЕсли;

			КонецЦикла;

			// Заполнение табличной части "Подарочные сертификаты".
			МассивСтрок = ПодарочныеСертификаты.НайтиСтроки(Новый Структура("ИндексПоАналитике", ВыборкаПоАналитике.ИндексПоАналитике));
			Для Каждого СтрокаТЧ Из МассивСтрок Цикл

				Если СтрокаТЧ.Сумма <> 0 Тогда
					СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.ПодарочныеСертификаты.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
				КонецЕсли;

			КонецЦикла;

			// Заполнение табличной части "БонусныеБаллы".
			МассивСтрок = БонусныеБаллы.НайтиСтроки(Новый Структура("ИндексПоАналитике", ВыборкаПоАналитике.ИндексПоАналитике));
			Для Каждого СтрокаТЧ Из МассивСтрок Цикл

				СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.НачислениеБонусныхБаллов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);

			КонецЦикла;

			// Заполнение табличной части "ОплатаБонуснымиБаллами".
			МассивСтрок = ОплатаБонуснымиБаллами.НайтиСтроки(Новый Структура("ИндексПоАналитике", ВыборкаПоАналитике.ИндексПоАналитике));
			Для Каждого СтрокаТЧ Из МассивСтрок Цикл

				СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.ОплатаБонуснымиБаллами.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);

			КонецЦикла;

			// Заполнение табличной части "АкцизныеМарки".
			МассивСтрок = АкцизныеМарки.НайтиСтроки(Новый Структура("ИндексПоАналитике", ВыборкаПоАналитике.ИндексПоАналитике));
			Для Каждого СтрокаТЧ Из МассивСтрок Цикл

				СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.АкцизныеМарки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);

			КонецЦикла;

			ОтчетОРозничныхПродажахОбъект.Дата            = ВыборкаРеквизитыКассовойСмены.ОкончаниеКассовойСмены;
			ОтчетОРозничныхПродажахОбъект.ЦенаВключаетНДС = ОтчетОРозничныхПродажахОбъект.ВидЦены.ЦенаВключаетНДС;
			ОтчетОРозничныхПродажахОбъект.КассоваяСмена   = КассоваяСмена;
			ОтчетОРозничныхПродажахОбъект.СуммаДокумента  = ЦенообразованиеКлиентСервер.ПолучитьСуммуДокумента(ОтчетОРозничныхПродажахОбъект.Товары, ОтчетОРозничныхПродажахОбъект.ЦенаВключаетНДС);

			ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(ОтчетОРозничныхПродажахОбъект);

			Если Не ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.Ответственный) Тогда
				ОтчетОРозничныхПродажахОбъект.Ответственный = Пользователи.ТекущийПользователь();
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.Подразделение) Тогда
				Если ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.КассаККМ)
					И ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.КассаККМ.Подразделение) Тогда
					ОтчетОРозничныхПродажахОбъект.Подразделение = ОтчетОРозничныхПродажахОбъект.КассаККМ.Подразделение;
				Иначе
					ОтчетОРозничныхПродажахОбъект.Подразделение = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(ОтчетОРозничныхПродажахОбъект.Ответственный, ОтчетОРозничныхПродажахОбъект.Подразделение);
				КонецЕсли;
			КонецЕсли;

			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(Документы.ОтчетОРозничныхПродажах.ПараметрыУказанияСерий(ОтчетОРозничныхПродажахОбъект));
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ОтчетОРозничныхПродажахОбъект, ПараметрыУказанияСерий);

			Если Не ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.НалогообложениеНДС) Тогда
				ОтчетОРозничныхПродажахОбъект.НалогообложениеНДС = Справочники.Организации.НалогообложениеНДС(
					ОтчетОРозничныхПродажахОбъект.Организация,
					ОтчетОРозничныхПродажахОбъект.Склад,
					ОтчетОРозничныхПродажахОбъект.Дата);
			КонецЕсли;

			Если Не ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.ОрганизацияЕГАИС) Тогда
				ОтчетОРозничныхПродажахОбъект.ОрганизацияЕГАИС = РозничныеПродажи.ПолучитьОрганизациюЕГАИС(
					ОтчетОРозничныхПродажахОбъект.Склад,
					ОтчетОРозничныхПродажахОбъект.Организация);
			КонецЕсли;

			Если ОтчетОРозничныхПродажахОбъект.Проведен Тогда
				ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;

		КонецЦикла;
		
		// По кассовой смене не продано товара
		Если ВыборкаПоАналитике.Количество() = 0 Тогда

			ОтчетОРозничныхПродажахОбъект.Дата           = ВыборкаРеквизитыКассовойСмены.ОкончаниеКассовойСмены;
			ОтчетОРозничныхПродажахОбъект.КассоваяСмена  = КассоваяСмена;

			ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(ОтчетОРозничныхПродажахОбъект);

			// Заполняет отчет о розничных продажах данными по текущей кассовой смене.
			РеквизитыКассовойСмены = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КассоваяСмена, "КассаККМ, ФискальноеУстройство");
			Если ЗначениеЗаполнено(РеквизитыКассовойСмены.КассаККМ) Тогда
				СтруктуруСостояниеКассовойСмены = ПолучитьРеквизитыКассовойСменыНаДату(РеквизитыКассовойСмены.КассаККМ, ВыборкаРеквизитыКассовойСмены.ОкончаниеКассовойСмены);
			Иначе
				СтруктуруСостояниеКассовойСмены = ПолучитьРеквизитыКассовойСменыНаДату(РеквизитыКассовойСмены.ФискальноеУстройство, ВыборкаРеквизитыКассовойСмены.ОкончаниеКассовойСмены);
			КонецЕсли;

			ЗаполнитьЗначенияСвойств(ОтчетОРозничныхПродажахОбъект, СтруктуруСостояниеКассовойСмены, , "КассоваяСмена");

			Если Не ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.Ответственный) Тогда
				ОтчетОРозничныхПродажахОбъект.Ответственный = Пользователи.ТекущийПользователь();
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.Подразделение) Тогда
				ОтчетОРозничныхПродажахОбъект.Подразделение = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(ОтчетОРозничныхПродажахОбъект.Ответственный, ОтчетОРозничныхПродажахОбъект.Подразделение);
			КонецЕсли;

			ОтчетОРозничныхПродажахОбъект.СуммаДокумента = ЦенообразованиеКлиентСервер.ПолучитьСуммуДокумента(ОтчетОРозничныхПродажахОбъект.Товары, ОтчетОРозничныхПродажахОбъект.ЦенаВключаетНДС);

			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(Документы.ОтчетОРозничныхПродажах.ПараметрыУказанияСерий(ОтчетОРозничныхПродажахОбъект));
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ОтчетОРозничныхПродажахОбъект, ПараметрыУказанияСерий);

			Если Не ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.НалогообложениеНДС) Тогда
				ОтчетОРозничныхПродажахОбъект.НалогообложениеНДС = Справочники.Организации.НалогообложениеНДС(
					ОтчетОРозничныхПродажахОбъект.Организация,
					ОтчетОРозничныхПродажахОбъект.Склад,
					ОтчетОРозничныхПродажахОбъект.Дата);
			КонецЕсли;

			Если ОтчетОРозничныхПродажахОбъект.Проведен Тогда
				ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;

		КонецЕсли;

		Возврат ОтчетОРозничныхПродажахОбъект.Ссылка;

	Исключение

		ОписаниеОшибки = НСтр("ru = 'При создании отчета о розничных продажах произошла ошибка.
		                            |Дополнительное описание:
		                            |%ДополнительноеОписание%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", ИнформацияОбОшибке().Описание);

		ЗаписьЖурналаРегистрации(НСтр("ru = 'Розничные продажи'"), УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);

		Возврат ?(ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.Ссылка), ОтчетОРозничныхПродажахОбъект.Ссылка, Неопределено);

	КонецПопытки;

КонецФункции

// Заполняет табличную часть "Оплата баллами Umico" отчета о розничных продажах.
// 
// Параметры:
//  ОтчетОРозничныхПродажахОбъект - ДокументОбъект.ОтчетОРозничныхПродажах - Отчет о розничных продажах объект
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц
Процедура UMC_ДополнитьОтчетОРозничныхПродажахОплатойUmico(ОтчетОРозничныхПродажахОбъект, МенеджерВременныхТаблиц) Экспорт
	
	ОтчетОРозничныхПродажахОбъект.UMC_ОплатаБалламиUmico.Очистить();
	
	UMC_Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЧекККМ.UMC_НомерКартыUmico,
	|	ЧекККМ.UMC_ОплаченноБалламиUmico
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	ЧекККМ.Ссылка В
	|		(ВЫБРАТЬ
	|			ЧекиККМ.Ссылка
	|		ИЗ
	|			ЧекиККМ КАК ЧекиККМ)
	|	И ЧекККМ.UMC_ОплаченноБалламиUmico <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМВозврат.UMC_НомерКартыUmico,
	|	-ЧекККМВозврат.UMC_ОплаченноБалламиUmico КАК UMC_ОплаченноБалламиUmico
	|ИЗ
	|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
	|ГДЕ
	|	ЧекККМВозврат.Ссылка В
	|		(ВЫБРАТЬ
	|			ЧекиККМ.Ссылка
	|		ИЗ
	|			ЧекиККМ КАК ЧекиККМ)
	|	И UMC_ОплаченноБалламиUmico <> 0");
	UMC_Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	UMC_Выборка = UMC_Запрос.Выполнить().Выбрать();
	
	Пока UMC_Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОтчетОРозничныхПродажахОбъект.UMC_ОплатаБалламиUmico.Добавить(), UMC_Выборка);	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
